Semana 7/Rails_Avanzado-A2/myrottenpotatoes/app/controllers/movies_controller.rb

  def show
    id = params[:id] # recuperamos el ID de la película de la ruta URI
    #byebug
      @movie = Movie.find(id) # buscar la película por ID única
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def update
    @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]