ExamenSustitutorio-CC3S2/Actividad-ES/app/controllers/movies_controller.rb

  def update
    @movie = Movie.find(params[:id])
    @movie.director = params[:director] # Agrega esta línea para asignar el director

    TraceLocation.trace(match: /activerecord/) { @movie.validate }

    if @movie.update(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "movies" SET "director" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["director", nil], ["updated_at", "2023-12-27 20:54:15.499749"], ["id", 5]]