Practica Calificada5/ActividadJavascript/rottenpotatoes-rails-intro/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"  ORDER BY release_date asc
---
  def index
    # Obtener todas las películas o filtrar por calificaciones seleccionadas
    @movies = Movie.all