Pruebas-JS-Ajax/myrottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "movies" SET "title" = ?, "rating" = ?, "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "The Hunger Games"], ["rating", "R"], ["release_date", "2018-10-31 00:00:00"], ["updated_at", "2023-11-27 01:01:39.294072"], ["id", 25]]
---
  def update
    @movie = Movie.find params[:id]
    if (@movie.update(movie_params))