PracticaCalificada4/Repo-Introduccion a Rails/myrottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY "movies"."title" ASC
---
  def index
    @movies = Movie.order(:title).all

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]
---
  def show
    begin
      id = params[:id] # retrieve movie ID from URI route
      raise params.inspect
    #byebug
      @movie = Movie.find(id) # look up movie by unique ID