Practica Calificada5/IntroduccionRails/myrottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 999], ["LIMIT", 1]]
---
  def show
    id = params[:id] # recuperamos el ID de la película de la ruta URI
    # byebug
    begin
      @movie = Movie.find(id) # buscar la película por ID única